---
kind: other
id: Properties.T:Autodesk.Revit.UI.Macros.ApplicationEntryPoint
source: html/0aedbd20-d01c-245d-2bc0-1e7c57669b44.htm
---
# ApplicationEntryPoint Properties

Get current active external application or external command id.